In [1]:
import pandas as pd
import database_utils as dbu

# 1. Test products table

In [3]:
query = '''
    select * 
    from products
    limit 6
'''

sample_products = dbu.query_sql(sql=query, database='supermarket.db')
sample_products

Query executed successfully!
query returned 6 rows

                   0              1       2
0            chicken           meat  5500.0
1               beef           meat  5000.0
2               pork           meat  4000.0
3            tilapia           meat  3500.0
4  laundry detergent     detergents  3000.0
5            shampoo  personal care  3000.0

# 2. Test transactions table

In [4]:
query = '''
    select * 
    from transactions
    limit 7
'''

sample_transactions = dbu.query_sql(sql=query, database='supermarket.db')
sample_transactions

Query executed successfully!
query returned 7 rows

                     0                  1     2           3
0  2021-03-01 09:00:00            oranges  29.0  location_1
1  2021-03-01 09:00:00  laundry detergent   6.0  location_1
2  2021-03-01 09:00:00            shampoo   4.0  location_1
3  2021-03-01 10:00:00               beef   8.0  location_1
4  2021-03-01 10:00:00             coffee   3.0  location_1
5  2021-03-01 10:00:00           cupcakes  11.0  location_1
6  2021-03-01 10:00:00            oranges  23.0  location_1

# 3. Test Prices table

In [6]:
query = '''
    select * 
    from prices
    
'''

sample_prices = dbu.query_sql(sql=query, database='supermarket.db')
sample_prices

Query executed successfully!
query returned 120 rows

              0              1       2
0    location_1         coffee   289.0
1    location_1            tea   538.0
2    location_1           soda  1811.0
3    location_1         loaves  3574.0
4    location_1           buns  2867.0
..          ...            ...     ...
115  location_5   toilet paper  1792.0
116  location_5   paper towels  2933.0
117  location_5        shampoo  4723.0
118  location_5      hand soap  3984.0
119  location_5  shaving cream  3358.0

[120 rows x 3 columns]

In [1]:
sorted_df = old_df.sort_values(by=['Unit Cost of Goods'], ascending=True)

NameError: name 'old_df' is not defined